/**************************************************
 * MKOnlinePlayer v2.32
 * 播放列表配置模块
 * 编写：mengkun(http://mkblog.cn)
 * 时间：2017-9-15
 *************************************************/
// 建议修改前先备份一下
// 获取 歌曲的网易云音乐ID 或 网易云歌单ID 的方法：
// 先在 js/player.js 中开启调试模式，然后按 F12 打开浏览器的控制台。播放歌曲或点开歌单即可看到相应信息

var musicList = [
    // 以下三个系统预留列表请勿更改，否则可能导致程序无法正常运行！
    // 预留列表：搜索结果
    {
        name: "搜索结果",   // 播放列表名字
        cover: "",          // 播放列表封面
        creatorName: "",        // 列表创建者名字
        creatorAvatar: "",      // 列表创建者头像
        item: []
    },
    // 预留列表：正在播放
    {
        name: "正在播放",   // 播放列表名字
        cover: "",          // 播放列表封面
        creatorName: "",        // 列表创建者名字
        creatorAvatar: "",      // 列表创建者头像
        item: []
    },
    // 预留列表：播放历史
    {
        name: "播放历史",   // 播放列表名字
        cover: "images/history.png",          // 播放列表封面
        creatorName: "",        // 列表创建者名字
        creatorAvatar: "",      // 列表创建者头像
        item: []
    },  
    // 以上三个系统预留列表请勿更改，否则可能导致程序无法正常运行！
    //*********************************************
    // 自定义列表开始，您可以自由添加您的自定义列表
    {
        id: 7367170343     // DamonMusic
    },
    {
        id: 3778678     // 云音乐热歌榜
    },
    
    {
        id: 3779629     // 云音乐新歌榜
    },
    
    {
        id: 19723756     // 云音乐飙升榜
    },
    {
        id: 2884035     // "网易原创歌曲榜"
    },

    {
        id: 5059642708     // "云音乐古风榜"
    },
    
    {
        id: 4857468062     // 抖音热歌
    },
    
    {
        id: 4395559     // 华语金曲榜
    },
    {
        id: 64016     // 中国TOP排行榜（内地榜）
    },
    {
        id: 112504     // 中国TOP排行榜（港台榜）
    },
    

    // 自定义列表教程开始！
    // 方式一：手动创建列表并添加歌曲信息
    // 温馨提示：各大音乐平台获取到的外链有效期均较短，因此 url 值应该设置为空，以让程序临时抓取
    {
        name: "Damon推荐",   // 播放列表名字
        cover: "http://p2.music.126.net/aXUPgImt8hhf4cMUZEjP4g==/109951165611417794.jpg", // 播放列表封面图像
        creatorName: "",        // 列表创建者名字(暂时没用到，可空)
        creatorAvatar: "",      // 列表创建者头像(暂时没用到，可空)
        item: [                 // 这里面放歌曲
            {
                id: "1483488153",  // 音乐ID
                name: "大天蓬 (抖音版)",  // 音乐名字
                artist: "璐爷", // 艺术家名字
                album: "大天蓬 (抖音版)",    // 专辑名字
                source: "netease",     // 音乐来源
                url_id: "1483488153",  // 链接ID
                pic_id: "2946691234868155",  // 封面ID
                lyric_id: "1483488153",  // 歌词ID
                pic: "http://p1.music.126.net/rn6L_xf1tlVAyHOz95mmMQ==/109951165354012465.jpg",    // 专辑图片
                url: ""   // mp3链接（此项建议不填，除非你有该歌曲的比较稳定的外链）
            },
            // 下面演示插入各个平台的音乐。。。
            {
                id: "1808492017",
                name: "错位时空",
                artist: "艾辰",
                album: "错位时空",
                source: "netease",      // 网易云
                url_id: "1808492017",
                pic_id: "18782957139233959",
                lyric_id: "1808492017",
                pic: "http://p2.music.126.net/8C0lwLE88j9ZwLyPQ9a4FA==/109951165595770076.jpg",
                url: ""
            },
            {
                id: "32422",
                name: "星辰大海",
                artist: "黄霄雲",
                album: "星辰大海",
                source: "tencent",      // 腾讯
                url_id: "32422",
                pic_id: "004DYsvN2QCYcj",
                lyric_id: "32422",
                pic: "https://y.qq.com/mediastyle/global/img/album_300.png?max_age=2592000",
                url: ""     // 腾讯的外链有效期较短，插入时 url [必须]设置空值，播放时再临时抓取
            },
            {
                id: "81175",
                name: "让我欢喜让我忧",
                artist: "周华健",
                album: "让我欢喜让我忧",
                source: "xiami",    // 虾米
                url_id: "81175",
                pic_id: "81175",
                lyric_id: "81175",
                pic: "https://pic.xiami.net/images/album/img58/1258/66271400572139.jpg@300h_300w_100q_1c.jpg",
                url: ""     // 虾米的外链有效期较短，插入时 url [必须]设置空值，播放时再临时抓取
            },
            {
                id: "44576378",
                name: "半生雪",
                artist: "是七叔呢",
                album: "半生雪",
                source: "kugou",        // 酷狗
                url_id: "44576378",
                pic_id: "44576378",
                lyric_id: "44576378",
                pic: "https://imgessl.kugou.com/stdmusic/20210512/20210512200010601947.jpg",
                url: ""     // 酷狗的外链有效期较短，插入时 url [必须]设置空值，播放时再临时抓取
            },
            {
                id: "44807660",
                name: "满目星辰皆是你",
                artist: "LKer林柯",
                album: "满目星辰皆是你v",
                source: "kugou",        // 百度
                url_id: "44807660",
                pic_id: "44807660",
                lyric_id: "44807660",
                pic: "https://imgessl.kugou.com/stdmusic/20210521/20210521161517124576.jpg",
                url: ""         // 百度的外链有效期较短，插入时 url [必须]设置空值，播放时再临时抓取
            }  // 列表中最后一首歌大括号后面不要加逗号
        ]
    },
    // 方式二：直接提供网易云歌单ID
    {
        id:3161132764  // 网易云歌单ID
    }   // 播放列表的最后一项大括号后面不要加逗号
];